#include <stdio.h>

// for, while, do ~ while 반복문


int main_for_while124132(void)
{
	/*

	// 1. while문
	// 조건식을 먼저 검사하고 조건식이 참인 동안 실행문을 반복

	while (조건부)
	{
		실행부;
	}

	*/


	/*

	// 2. for 문
	// 실행문을 원하는 횟수만큼 반복할때 사용
	// 초기식, 조건식, 증감식으로 반복 획수 제어해 실행부 문장 반복

	for (초기식, 조건식, 증감식)
	{
		실행부;
	}

	*/


	/*

	// 3. do ~ while 문
	// 먼저 반복할 문장을 한번 수행하고나서 조건을 검사하여 while문으로 동작

	do
	{
		실행부;
	} while (조건부);

	*/

	/*

	// 4. 중첩반복문
	// 모든 반복문은 중첩이 가능하다.
	// break 사용해 반복 끝내거나 continue로 반복 문장 일부 건너띄기 가능

	// 1) break
	// 반복문 안에서 반복 즉시 끝낼때 사용
	// break는 자신 포함하는 반복문 하나만 벗어난다
	// 완전히 벗어나고 싶으면 그만큼 break를 각 반복문 마다 다 걸어줘야함

	// 2) continue
	// 반복문의 일부 건너쮬
	// 반복문 안에서 사용시 가음 식행 위치 반복문 끝으로 이동
	// while에서 사용하면 증감식이 실행되지 않으므로 무한반복될수 있다!!!

	*/

	return 0;
	
}